#include <stdio.h>

int main () {
int i;
printf ("Ingrese variable \n");
scanf ("%d",&i);
while (i!=0) {
    printf ("i=%d \n",i);
    i=i-1;
}
printf ("i=%d",i);
return 0;

/*
programa e)
σ0:(i->4)
σ(1/1):i->4,σ(2/1):i->3,σ(3/1):i->2,σ(4/1):i->1
σ(1/2):i->3,σ(2/2):i->2,σ(3/2):i->1,σ(4/2):i->0
σ3:(i->0)

programa f)
σ0:(i->400)
σ(1/1):i->400,σ(2/1):i->399,σ(3/1):i->398,σ(4/1):i->397,...,σ(398/1):i->4,σ(399/1):i->2,σ(400/1):i->1,
σ(1/2):i->399,σ(2/2):i->398,σ(3/2):i->397,σ(4/2):i->396,...,σ(398/2):i->3,σ(399/2):i->1,σ(400/2):i->0
σ3:(i->0)
*/
}